[
    {"reviewer":"John","date_reviewed":"01/31/2025","star_rating":5,"message":"Item arrived quickly and the seller was communicative! It holds my Commander Decks well."},
    {"reviewer":"Saul","date_reviewed":"01/30/2025","star_rating":5,"message":"perfect size for taking all your dice, a playmat and 2-4 decks depending on your deckbox."},
    {"reviewer":"Dietrich","date_reviewed":"01/21/2025","star_rating":5,"message":"Arrived quick and works great for quick trips to locals."},
    {"reviewer":"Jeremiah","date_reviewed":"01/17/2025","star_rating":4,"message":"Fits many decks, lots of storage. However, there isnt a loop to attach the strap to on the bottom middle of the bag, so it hangs a bit wierd."},
    {"reviewer":"Becky","date_reviewed":"01/17/2025","star_rating":5,"message":"Purchased this mat for a gift for my husband. He really likes it and will use it for his games with friends and at his LGS!"},
    {"reviewer":"Sign in with Apple user","date_reviewed":"01/13/2025","star_rating":5,"message":"Super nice and very handy"},
    {"reviewer":"Bethany","date_reviewed":"01/06/2025","star_rating":5,"message":"I bought this for my husband as he recently started to get into MTG and he loves it! Fits 4 boxes of his cards as well as dice and mat very well."},
    {"reviewer":"Lena","date_reviewed":"01/03/2025","star_rating":5,"message":"So, a few things. The bag is smaller than I expected. Its a mini backpack, which I couldnt tell from the photos. My playmat is a bit too big for it, but Ive got a cover on mine. So who knows. It can hold a few commander deck boxes, but barely mtg foundations deck boxes, because again, it is a mini backpack and not full sized. However, the customer service is phenomenal. I wanted Pink, and they happily ordered it for me at no extra cost. So if you dont mind it being a bit smaller, its a great product!"},
    {"reviewer":"Alex","date_reviewed":"12/31/2024","star_rating":5,"message":"Great quality! Arrived in time for Christmas for me to give to a good friend who frequents Magic tournaments. He really liked it! It was able to fit at least 2 decks, another side-by-side double deck box, and his 4 pocket trade binder, all with the playmat secured tightly in front. Great buy, great seller! Thanks!"},
    {"reviewer":"katiegaverth","date_reviewed":"12/30/2024","star_rating":5,"message":"A bit smaller than I expected but it matches the description and fits five regular deck boxes plus a couple dice."},
    {"reviewer":"Sign in with Apple user","date_reviewed":"12/24/2024","star_rating":5,"message":"I bought one as a gift, I liked it so much I bought one for myself."},
    {"reviewer":"Mike","date_reviewed":"12/11/2024","star_rating":5,"message":"This bag is awesome! Perfect to load up for a trip to the LGS, or in my case, taking a few decks in to work for lunchtime MTG :) The quality seems really nice and I think it will last me a long time. I was able to fit 4 deck boxes and a bulging dice bag into the main compartment with no issues. I still have plenty of space in the front pocket to toss in my keys and wallet. Or if you really need the space, I was able to fit a standard deck box (60 cards sleeved) into the front pocket as well. Seller was great and shipping was really quick, almost like it was hand delivered! Will definitely order again from this store!"},
    {"reviewer":"Sign in with Apple user","date_reviewed":"12/10/2024","star_rating":5,"message":"Nice bag it holds 4 commander decks plus dice.  I'll will be purchasing a second one"},
    {"reviewer":"Tyler O'Neill","date_reviewed":"12/03/2024","star_rating":5,"message":"Great bag tons of features it looks small but actually holds quite a bit and seems pretty durable."},
    {"reviewer":"Walter","date_reviewed":"12/02/2024","star_rating":5,"message":"Looks great. I love it. Arrived fast"},
    {"reviewer":"Sign in with Apple user","date_reviewed":"11/15/2024","star_rating":5,"message":"Getting as a gift and know they will love it! Perfect base for a great set."},
    {"reviewer":"Travis","date_reviewed":"11/14/2024","star_rating":4,"message":"Good bag for sure.  Love that I get to choose the color of cords on it and love the playmat holder.  Holds a playmat in or out of a standard size tube.  I cannot fit 4 or 5 deck boxes in here but 3 fits very easy and fine.  I'm sure some slightly smaller deck boxes could fit 4 or possibly 5.  Overall it fits my needs very well for my local store visits on a weekly basis.  Great small compact bag.  Holds your decks, tokens, dice, keys and wallet perfectly. Would recommend."},
    {"reviewer":"Jacob","date_reviewed":"11/13/2024","star_rating":5,"message":"Fast shipping, great quality, exactly what I need for my trips to my LGS"},
    {"reviewer":"Jacob","date_reviewed":"11/13/2024","star_rating":5,"message":"Fast shipping, great quality, exactly what I need for my trips to my LGS"},
    {"reviewer":"Becca","date_reviewed":"11/09/2024","star_rating":5,"message":"Shipping was super fast.  It's a gift, but I think the recipient will like it! Should make it easier to transport cards to in-person gaming events."},
    {"reviewer":"Andrew","date_reviewed":"10/29/2024","star_rating":5,"message":"In LOVE with this bag, it's the perfect size, has all the features I was looking for, and is really well made. Absolutely perfect for a convention, carry everything you need in one package."},
    {"reviewer":"Christopher","date_reviewed":"10/23/2024","star_rating":5,"message":"This bag is AMAZING! I am blown away by the quality of this bag.\n\nI can fit my Double Deck box in the main compartment, and there are SO MANY POCKETS for me to store extra sleeves, top loaders, anything else I would need at he store.  I love the Storage for the playmat as well.\n\nThe shoulder strap  can be tucked in the back if you prefer to carry, and is comfortable to wear. \n\nThis is the perfect \"Grab and go\" bag to take to your LGS."}
]